---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinLengthn2
source: html/67dcb25e-8797-031c-cdac-c4f7dc44b440.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinLengthn2 Property

"Alternating Bar - Length"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinLengthn2 { get; }
```